In [1]:
import pandas as pd 
import psycopg2

In [2]:
conn = psycopg2.connect(host='localhost',
                        dbname='sql_practice',
                        user='postgres',
                        password='Aujaswi@31',
                        port=5432)
conn.autocommit = True
cur = conn.cursor()

# Question

### You are given a table of product launches by company by year. Write a query to count the net difference between the number of products companies launched in 2020 with the number of products companies launched in the previous year. Output the name of the companies and a net difference of net products released for 2020 compared to the previous year.

## Creating the table

In [3]:
cur.execute("""CREATE TABLE car_launches(year int, company_name varchar(15), product_name varchar(30));""")

## Populating the table

In [4]:
cur.execute("""INSERT INTO car_launches VALUES(2019,'Toyota','Avalon'),(2019,'Toyota','Camry'),(2020,'Toyota','Corolla'),(2019,'Honda','Accord'),(2019,'Honda','Passport'),(2019,'Honda','CR-V'),(2020,'Honda','Pilot'),(2019,'Honda','Civic'),(2020,'Chevrolet','Trailblazer'),(2020,'Chevrolet','Trax'),(2019,'Chevrolet','Traverse'),(2020,'Chevrolet','Blazer'),(2019,'Ford','Figo'),(2020,'Ford','Aspire'),(2019,'Ford','Endeavour'),(2020,'Jeep','Wrangler');""")

### Solution

In [5]:
cur.execute("""WITH launch_2019 AS (SELECT company_name, COUNT(product_name) num_products FROM car_launches WHERE year = 2019 GROUP BY 1),
	 launch_2020 AS (SELECT company_name, COUNT(product_name) num_products FROM car_launches WHERE year = 2020 GROUP BY 1)

SELECT a.company_name company_name, (a.num_products - b.num_products) net_difference
FROM launch_2020 a
FULL OUTER JOIN launch_2019 b ON a.company_name = b.company_name;""")

In [6]:
df = pd.DataFrame(cur.fetchall(),columns=['company_name','net_difference'])

In [7]:
df

  company_name  net_difference
0    Chevrolet             2.0
1         Ford            -1.0
2        Honda            -3.0
3         Jeep             NaN
4       Toyota            -1.0

In [9]:
cur.execute("""DROP TABLE car_launches;""")

In [10]:
cur.close()
conn.close()